PANDAS LIBRARY

In [10]:
import pandas as pd

In [11]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
df.tail(5
       )

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [14]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [15]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [16]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
df[['Name','Sex','Ticket','Cabin','Embarked']]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [18]:
df.dtypes=='object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [19]:
df.dtypes=='float64'

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin          False
Embarked       False
dtype: bool

In [20]:
df[df.dtypes[df.dtypes=='float64'].index]

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [22]:
df[['Ticket']]

               Ticket
0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
..                ...
886            211536
887            112053
888        W./C. 6607
889            111369
890            370376

[891 rows x 1 columns]

In [23]:
df[['Ticket']][4:16]

       Ticket
4      373450
5      330877
6       17463
7      349909
8      347742
9      237736
10    PP 9549
11     113783
12  A/5. 2151
13     347082
14     350406
15     248706

In [24]:
df[['Ticket']][4:16:2] #n+1 for 1 value gap

       Ticket
4      373450
6       17463
8      347742
10    PP 9549
12  A/5. 2151
14     350406

In [25]:
df[['Ticket','Cabin']][4:14]

       Ticket Cabin
4      373450   NaN
5      330877   NaN
6       17463   E46
7      349909   NaN
8      347742   NaN
9      237736   NaN
10    PP 9549    G6
11     113783  C103
12  A/5. 2151   NaN
13     347082   NaN

In [26]:
df[['Ticket','Cabin']][4:14:2]

       Ticket Cabin
4      373450   NaN
6       17463   E46
8      347742   NaN
10    PP 9549    G6
12  A/5. 2151   NaN

In [27]:
df[['Ticket','Cabin','Fare']][4:14]

       Ticket Cabin     Fare
4      373450   NaN   8.0500
5      330877   NaN   8.4583
6       17463   E46  51.8625
7      349909   NaN  21.0750
8      347742   NaN  11.1333
9      237736   NaN  30.0708
10    PP 9549    G6  16.7000
11     113783  C103  26.5500
12  A/5. 2151   NaN   8.0500
13     347082   NaN  31.2750

In [28]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [31]:
df['new_col']=2

In [32]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,2
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,2
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,2
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,2

In [33]:
df.insert(loc=3,column ='food',value='panipuri')

In [34]:
df

,PassengerId,Survived,Pclass,food,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,panipuri,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,panipuri,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,panipuri,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,panipuri,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,panipuri,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,panipuri,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,2
887,888,1,1,panipuri,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,2
888,889,0,3,panipuri,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,panipuri,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,2
890,891,0,3,panipuri,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,2

In [38]:
df.insert(loc=6,column ='Equipment',value='oxygen cylinder')

<class 'ValueError'>: cannot insert Equipment, already exists

In [39]:
df

,PassengerId,Survived,Pclass,food,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,panipuri,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,panipuri,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,panipuri,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,panipuri,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,oxygen cyclinder,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,panipuri,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,panipuri,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S,2
887,888,1,1,panipuri,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S,2
888,889,0,3,panipuri,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,panipuri,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C,2
890,891,0,3,panipuri,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q,2

In [40]:
df

,PassengerId,Survived,Pclass,food,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,panipuri,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,panipuri,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,panipuri,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,panipuri,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,oxygen cyclinder,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,panipuri,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,panipuri,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S,2
887,888,1,1,panipuri,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S,2
888,889,0,3,panipuri,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,panipuri,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C,2
890,891,0,3,panipuri,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q,2

Data cleaning

In [45]:
df

,PassengerId,Survived,Pclass,food,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,panipuri,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,panipuri,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,panipuri,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,panipuri,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,oxygen cyclinder,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,panipuri,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,panipuri,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S,2
887,888,1,1,panipuri,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S,2
888,889,0,3,panipuri,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,panipuri,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C,2
890,891,0,3,panipuri,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q,2

In [46]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [49]:
a=df['Name'][0:10]

In [50]:
a

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [51]:
type(a)

pandas.core.series.Series

In [54]:
l=['swati','a2','a3','a4','a5','a6','a7','a8','a9','a10']

In [55]:
pd.Series(a,index=l)

swati    NaN
a2       NaN
a3       NaN
a4       NaN
a5       NaN
a6       NaN
a7       NaN
a8       NaN
a9       NaN
a10      NaN
Name: Name, dtype: object

In [56]:
pd.Series(list(a),index=l)

swati                              Braund, Mr. Owen Harris
a2       Cumings, Mrs. John Bradley (Florence Briggs Th...
a3                                  Heikkinen, Miss. Laina
a4            Futrelle, Mrs. Jacques Heath (Lily May Peel)
a5                                Allen, Mr. William Henry
a6                                        Moran, Mr. James
a7                                 McCarthy, Mr. Timothy J
a8                          Palsson, Master. Gosta Leonard
a9       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
a10                    Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [57]:
m1=pd.Series([100,200,300,400,500],index=[1,2,3,4,5])

In [58]:
m1

1    100
2    200
3    300
4    400
5    500
dtype: int64

In [59]:
m2=pd.Series([600,700,800,900,1000],index=[1,2,3,4,5])

In [60]:
m2

1     600
2     700
3     800
4     900
5    1000
dtype: int64

In [62]:
m=pd.concat([m1,m2])

In [63]:
m

1     100
2     200
3     300
4     400
5     500
1     600
2     700
3     800
4     900
5    1000
dtype: int64

In [64]:
m[1]

1    100
1    600
dtype: int64

In [65]:
m1*m2

1     60000
2    140000
3    240000
4    360000
5    500000
dtype: int64

In [66]:
m1+m2

1     700
2     900
3    1100
4    1300
5    1500
dtype: int64

In [67]:
df.head()

,PassengerId,Survived,Pclass,food,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,panipuri,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,panipuri,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,panipuri,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,panipuri,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,oxygen cyclinder,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,panipuri,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S,2

In [69]:
df.drop('food',axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,oxygen cyclinder,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S,2
887,888,1,1,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S,2
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C,2
890,891,0,3,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q,2

In [70]:
df

,PassengerId,Survived,Pclass,food,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,panipuri,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,panipuri,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,panipuri,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,panipuri,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,oxygen cyclinder,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,panipuri,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,panipuri,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S,2
887,888,1,1,panipuri,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S,2
888,889,0,3,panipuri,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,panipuri,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C,2
890,891,0,3,panipuri,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q,2

In [72]:
df.drop('food',axis=1,inplace=True)

In [73]:
df

,PassengerId,Survived,Pclass,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,oxygen cyclinder,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S,2
887,888,1,1,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S,2
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C,2
890,891,0,3,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q,2

In [74]:
df.drop('new_col',axis=1,inplace=True)

In [75]:
df

,PassengerId,Survived,Pclass,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,oxygen cyclinder,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q

In [76]:
df.drop(3)

,PassengerId,Survived,Pclass,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,oxygen cyclinder,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q

In [77]:
df

,PassengerId,Survived,Pclass,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,oxygen cyclinder,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q

In [79]:
df.drop(3,inplace=True)

In [80]:
df

,PassengerId,Survived,Pclass,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,oxygen cyclinder,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q

In [81]:
df.set_index('Name')

,PassengerId,Survived,Pclass,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Allen, Mr. William Henry",5,0,3,male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,oxygen cyclinder,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,0,2,male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S
"Graham, Miss. Margaret Edith",888,1,1,female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",889,0,3,female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S
"Behr, Mr. Karl Howell",890,1,1,male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,0,3,male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q

In [82]:
df

,PassengerId,Survived,Pclass,Name,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,oxygen cyclinder,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q

In [83]:
df.set_index('Name',inplace=True)

In [84]:
df

,PassengerId,Survived,Pclass,Sex,Equipment,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,oxygen cyclinder,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,oxygen cyclinder,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,oxygen cyclinder,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Allen, Mr. William Henry",5,0,3,male,oxygen cyclinder,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,oxygen cyclinder,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,0,2,male,oxygen cyclinder,27.0,0,0,211536,13.0000,NaN,S
"Graham, Miss. Margaret Edith",888,1,1,female,oxygen cyclinder,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",889,0,3,female,oxygen cyclinder,NaN,1,2,W./C. 6607,23.4500,NaN,S
"Behr, Mr. Karl Howell",890,1,1,male,oxygen cyclinder,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,0,3,male,oxygen cyclinder,32.0,0,0,370376,7.7500,NaN,Q

Making data frame from dictionary

In [85]:
d={
    'key1':[1,2,3,4,5],
    'key2':[6,7,8,9,10],
    'key3':[11,12,13,14,15]
}

In [86]:
print(d)

{'key1': [1, 2, 3, 4, 5], 'key2': [6, 7, 8, 9, 10], 'key3': [11, 12, 13, 14, 15]}

In [87]:
pd.DataFrame(d)

   key1  key2  key3
0     1     6    11
1     2     7    12
2     3     8    13
3     4     9    14
4     5    10    15

In [88]:
e={
    'key':['ram','shyam'],
    'key1':['pink','black']
}

In [89]:
print(e)

{'key': ['ram', 'shyam'], 'key1': ['pink', 'black']}

In [90]:
pd.DataFrame(e)

     key   key1
0    ram   pink
1  shyam  black